Public Attributes | List of all members
API_PlaceInfo Struct Reference
Geolocation
The current location, date and sun parameters. More...
#include <APIdefs_Environment.h>
 Public Attributes
bool  | sumTime
true if daylight saving time is in effect
unsigned short  | year
The year at the given place.
unsigned short  | month
The month at the given place.
unsigned short  | day
The day at the given place.
unsigned short  | hour
The hour at the given place.
unsigned short  | minute
The minute at the given place.
unsigned short  | second
The second at the given place.
double  | longitude
longitude in degrees
double  | latitude
latitude in degrees
double  | altitude
altitude in meters
double  | north
North direction in radians.
double  | sunAngXY
Sun position component in radians.
double  | sunAngZ
Sun position component in radians.
API_NorthUnitID  | northUnit
angle unit of north direction. See also: API_NorthUnitID
API_AltitudeUnitID  | altitudeUnit
display altitude in meters or feet. See also: API_AltitudeUnitID
API_LongLatUnitID  | longLatUnit
display latLongUnit in decimal degrees or degrees, minutes and seconds. See also: API_LongLatUnitID
short  | timeZoneInMinutes
Time zone in minutes from Greenwich.
short  | timeZoneOffset
Used when different timezones have the same timeZoneInMinutes.
Detailed Description
The current location, date and sun parameters.
Since
Archicad 26
Remarks
This structure is used to hold the consistent location, date and sun parameters. It can be used either to retrieve the current parameter set (see the ACAPI_GeoLocation_GetPlaceSets function); or to calculate the sun angles in a given place at a given time (see the ACAPI_GeoLocation_CalcSunOnPlace function); or to set/change and the current parameter set (see ACAPI_GeoLocation_ChangePlaceSets function).
Member Data Documentation
◆ altitude
 API_PlaceInfo::altitude
altitude in meters
◆ altitudeUnit
 API_PlaceInfo::altitudeUnit
display altitude in meters or feet. See also: API_AltitudeUnitID
◆ day
 API_PlaceInfo::day
The day at the given place.
◆ hour
 API_PlaceInfo::hour
The hour at the given place.
◆ latitude
 API_PlaceInfo::latitude
latitude in degrees
◆ longitude
 API_PlaceInfo::longitude
longitude in degrees
◆ longLatUnit
 API_PlaceInfo::longLatUnit
display latLongUnit in decimal degrees or degrees, minutes and seconds. See also: API_LongLatUnitID
◆ minute
 API_PlaceInfo::minute
The minute at the given place.
◆ month
 API_PlaceInfo::month
The month at the given place.
◆ north
 API_PlaceInfo::north
North direction in radians.
◆ northUnit
 API_PlaceInfo::northUnit
angle unit of north direction. See also: API_NorthUnitID
◆ second
 API_PlaceInfo::second
The second at the given place.
◆ sumTime
 API_PlaceInfo::sumTime
true if daylight saving time is in effect
◆ sunAngXY
 API_PlaceInfo::sunAngXY
Sun position component in radians.
◆ sunAngZ
 API_PlaceInfo::sunAngZ
Sun position component in radians.
◆ timeZoneInMinutes
 API_PlaceInfo::timeZoneInMinutes
Time zone in minutes from Greenwich.
◆ timeZoneOffset
 API_PlaceInfo::timeZoneOffset
Used when different timezones have the same timeZoneInMinutes.
◆ year
 API_PlaceInfo::year
The year at the given place.